#### The DemoDB function returns a very useful database instance for testing.

In [1]:
from db import DemoDB
import pandas as pd

## Loading deafult DemoDB

In [2]:
database = DemoDB()

Indexing schema. This will take a second...finished!

In [3]:
database.tables

Refreshing schema. Please wait...done!

+--------+---------------+----------------------------------------------------------------------------------+
| Schema | Table         | Columns                                                                          |
+--------+---------------+----------------------------------------------------------------------------------+
| public | Album         | AlbumId, Title, ArtistId                                                         |
| public | Artist        | ArtistId, Name                                                                   |
| public | Customer      | CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalC |
|        |               | ode, Phone, Fax, Email, SupportRepId                                             |
| public | Employee      | EmployeeId, LastName, FirstName, Title, ReportsTo, BirthDate, HireDate, Address, |
|        |               |  City, State, Country, PostalCode, Phone, Fax, Email                             |
| public | Genre         | GenreId, Name                                                                    |
| public | Invoice       | InvoiceId, CustomerId, InvoiceDate, BillingAddress, BillingCity, BillingState, B |
|        |               | illingCountry, BillingPostalCode, Total                                          |
| public | InvoiceLine   | InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity                           |
| public | MediaType     | MediaTypeId, Name                                                                |
| public | Playlist      | PlaylistId, Name                                                                 |
| public | PlaylistTrack | PlaylistId, TrackId                                                              |
| public | Track         | TrackId, Name, AlbumId, MediaTypeId, GenreId, Composer, Milliseconds, Bytes, Uni |
|        |               | tPrice                                                                           |
+--------+---------------+----------------------------------------------------------------------------------+

In [4]:
# Converting the table albuns to a dataframe
albuns = database.tables.Album.all()
albuns.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [5]:
# Converting the table artist to a dataframe
artists = database.tables.Artist.all()
artists.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

### Join two dataframes

In [6]:
dataframe = pd.merge(artists, albuns)

In [7]:
dataframe.head()

   ArtistId       Name  AlbumId                                  Title
0         1      AC/DC        1  For Those About To Rock We Salute You
1         1      AC/DC        4                      Let There Be Rock
2         2     Accept        2                      Balls to the Wall
3         2     Accept        3                      Restless and Wild
4         3  Aerosmith        5                               Big Ones

#### Rename the ArtistId of artist

In [8]:
# Rename 'ArtistID column to 'Artist_ID'
albuns.rename(columns={'ArtistId': 'Artist_ID'}, inplace=True)

In [9]:
# Merge tables using columns ArtistId of artists dataframe and
# 'Artist_ID of albuns dataframe.
dataframe = pd.merge(artists, albuns, left_on="ArtistId", right_on='Artist_ID')

In [10]:
dataframe.head()

,ArtistId,Name,AlbumId,Title,Artist_ID
0,1,AC/DC,1,For Those About To Rock We Salute You,1
1,1,AC/DC,4,Let There Be Rock,1
2,2,Accept,2,Balls to the Wall,2
3,2,Accept,3,Restless and Wild,2
4,3,Aerosmith,5,Big Ones,3

In [11]:
# Drop 'Artist_ID' column
dataframe.drop('Artist_ID', axis=1, inplace=True)